{"reviews": {"99040613": {"recommendationid": "99040613", "author": {"steamid": "76561198083293958", "num_games_owned": 377, "num_reviews": 18, "playtime_forever": 1551, "playtime_last_two_weeks": 0, "playtime_at_review": 1304, "last_played": 1631193892}, "language": "english", "review": "Casual game; Not really good or bad. In this game, you have to select which food you serve in which area and at which price. \nYou get the opportunity to buy upgrade and change the color of the food truck to attract more customers. \n\nBut that's where the big problem is: you don't get a tutorial or hint.\n-->  You get NO feedback or hint about the things you propose. Customers don't say anything - for example that's it's too expensive, or that they didn't like the meals proposed or that i proposed too many units of that item. You get NO advises or confirmation the items you selected are the right one. \nYou can only see how many items have been sold that day for each meal and ONLY if you click on the truck. This info is only one truck at a time and for a short/limited period of time. Thus, the variations in sales are very little so it's hard to notice if they really dislike that meal or not. On top of it, the sales naturally varies with the weather (Sunny, Cloud, Rain) and the day of the week so you have to wait similar days to really compare - making it very grindy and quite random. \nAlso good placements are not necessary \"logical\"; I could see that expensive food can be sold more easily at the airport --> Who spend a huge amount of monney to eat in an airport ??\n\nYou can finish the game quite easily but getting that 50k sales / day achievement is a nightmare and it's quite unfortunate to play a mangement game... in a complete random way.\n\nPS: If someone makes a guide, please tell me :D", "timestamp_created": 1631179148, "timestamp_updated": 1631179148, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519230782985687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "89843735": {"recommendationid": "89843735", "author": {"steamid": "76561197993520745", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 542, "playtime_last_two_weeks": 0, "playtime_at_review": 542, "last_played": 1520058595}, "language": "english", "review": "Boring game with no real points to enjoy, it is a bland and poinless game with no replay value.", "timestamp_created": 1617734221, "timestamp_updated": 1617734221, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77491911": {"recommendationid": "77491911", "author": {"steamid": "76561198212464320", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 398, "playtime_last_two_weeks": 0, "playtime_at_review": 352, "last_played": 1602690391}, "language": "english", "review": "A simple, easy to understand tycoon game. The game offers quite an array of food to serve which is amazing, ranging from teas, drinks, fast foods, to culinary cuisines. The gameplay is quite straightforward, though there are some confusing parts like Investor information before any Investor is actually available and how to change the number of food served.\n\nFor most part, I try selling stuff at quite a high price and it seems to work itself out. A key tactic I have found is to get a spot \"traffic pattern\" to adjust the food served properly for that particular spot. Even if multiple areas are deficit, one major profit can reverse the tide (especially on bad days).\n\nI personally like this game for the simplicity yet enjoyment it gives me and thus would recommend this game, especially for those who seek to play a tycoon game without stressful economy management.", "timestamp_created": 1602587272, "timestamp_updated": 1602587272, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54355969": {"recommendationid": "54355969", "author": {"steamid": "76561198161444756", "num_games_owned": 7530, "num_reviews": 71, "playtime_forever": 695, "playtime_last_two_weeks": 0, "playtime_at_review": 695, "last_played": 1564343078}, "language": "english", "review": "The Game is a simple tycoon game but my end valuation is this time very hard to figure out.\nI tested it 10h and found good and not so good things.\nThe most cons are very tiny/little but all in all they summarise.\n\n[h1]Pro's:[/h1]\n+ A simple tycoon game that isn't difficult but not totally easy too\n+ The shop trailer show you exactly what you get\n+ The game have trading cards\n\n[h1]Neutral:[/h1]\n- The Art looks as bit as for teens made or want to be a bit cute. You will like it or not.\n\n[h1]Con's:[/h1]\n- The music and sounds are much too loud and the options aren't saved. So you need to set the options for the music and sound each time you start the game\n- The save slot and cursor blinking in a much too fast way, so it is partly annoying and maybe a problem for people with epilepsy\n- One Investor, Mr. Snowman, should offer at least 2k $ for 40%-60% BUT he offer 1k and 1,5k too and 39 - 61%.\n- Unclear how exactly different colors change the consumers order behavior.\n- To slow progress and/or to repetitive\n- The price\n\nIt costs 7$ but you should buy it only at a sale for around 3$ because of the repetitive gameplay with a slow progress.\nMy final valuation of 5/10 is given for a sale price and with the hope that the Dev's will work at the, mostly, small con's i listed above.\n\n\n[h1]Rating:[/h1]\n[h1]5/10[/h1]\n\n\n[quote][url=https://store.steampowered.com/curator/30583719-Masafors-Group-of-Friends/]Follow [b]Masafors Group of Friends[/b], if you want to read more reviews like this one in English, German, French or Belgian Dutch.[/url][/quote]", "timestamp_created": 1564405213, "timestamp_updated": 1599418066, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.584779441356658936", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53726676": {"recommendationid": "53726676", "author": {"steamid": "76561198022458871", "num_games_owned": 556, "num_reviews": 556, "playtime_forever": 784, "playtime_last_two_weeks": 0, "playtime_at_review": 784, "last_played": 1562360924}, "language": "english", "review": "It's a cute, casual game if you have some time to waste. Achievements are pretty straight forward, but some of them seem impossible to get. The devs will personally help you out if you need it, so that is a plus.", "timestamp_created": 1562370169, "timestamp_updated": 1562370169, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47209407": {"recommendationid": "47209407", "author": {"steamid": "76561198159032539", "num_games_owned": 2625, "num_reviews": 27, "playtime_forever": 235, "playtime_last_two_weeks": 0, "playtime_at_review": 152, "last_played": 1543583558}, "language": "english", "review": "the game looks very unattractive at the first time i play the game, but after give it some more  chance to play , it became quite interesting. It hard at the first try because the profit you get from selling goods in the game is so low, it takes me 2 month to get the objective sales. If you like this kind of games, maybe you can give this game a chance.", "timestamp_created": 1543585831, "timestamp_updated": 1543585831, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.605640172958374023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41898452": {"recommendationid": "41898452", "author": {"steamid": "76561198006963719", "num_games_owned": 10065, "num_reviews": 105, "playtime_forever": 449, "playtime_last_two_weeks": 0, "playtime_at_review": 449, "last_played": 1525662823}, "language": "english", "review": "This game is basically a lemonade tycoon clone - differences are so subtle that they're not even worth mentioning. Sure, you can sell different kinds of food, if you call \"food\" another texture with base price bumped, since all of them are not any different at all.\n\nThis game had premise of being good, I enjoyed it for the first 10 minutes or so, I even finished this damn thing, and the amount of negatives that exist here are just too damn overwhelming to make me recommend this to anyone.\n\nFirst and foremost, OPTIMIZATION. Holy shit this word doesn't exist in vocabulary of the devs, the moment I noticed that game drops FPSes to 30 in the freaking menu when you're switching tabs I knew something fishy is going on, but I didn't expect THAT amount. Game is basically unplayable (10 FPS and less) at later stage of the campaign because apparently devs didn't expect anybody to get that far, so nobody really tested it on any hardware whatsoever. Unless you want to tell me that 1080 GTX Ti with i7 7700k overclocked to 4.5 GHz running Witcher 3 on all ultra 120+ FPS is too weak to handle a flash game that could be released in early 2000, then sorry, maybe you should mark it with \"requires high-tier rig from 2023\" instead.\n\nSecond thing, gameplay. Lemonade tycoon was repetitive, but satisfying. It was challenging, yet rewarding. It didn't struggle with having 4x as much customers as the one here, but we talked about optimization already. The thing is, this game really doesn't offer a lot. I mean, look at this, you're a guy, renting food stalls, buying food trucks and doing all kind of shit. How hard it'd be to implement any more complex factor into the game, like I don't know, the fact that customers don't give a flying fuck about two food trucks next to each other, selling the same freaking food in the same freaking price. It looks like I'm feeding freaking starving North Korea or something, everybody jump onto that food giving no shit what that is, how much it costs and where we even are. I totally get it how you'd love a cup of hot chocolate in the middle of the beach, so I set up 2 large food trucks selling hot chocolate only, specially for you. I get it, it's a simple game, but somehow price adjusting, upgrades, marketing, and even damn investments made it in, but basic consumers logic did not.\n\nThird thing, bugs. Bugs are everywhere - not even worth mentioning them all. Here is one: once I finished the game it decided to overwrite my save with exactly where I left it, apart from destroying all my food trucks and all foods I've unlocked. I thought at first \"okay, they probably did that in case I wanted to start over or something\", but then all goals are already achieved, so there is pretty much no way to unlock all of that again. I checked other reviews and forums, maybe I just had a bad luck or something, happens even to the best. Nope, another guy with exactly the same issue. Hah, just great.\n\nI like indie games, I like to see effort and gameplay, not AAA graphics, overwhelming marketing and announcing the game like it was revolution of last 30 years in game industry. But this game is really lacking in depth. I get it that it's supposed to be simple, maybe for half-retarded children of some sort that can only click one button and move forward, but it really wouldn't hurt to polish this game a little, because it's easier to say what is alright with this game rather than what is not.\n\nIf there was a mixed review, I'd rate it as such. But there is no such option, and the amount of negatives this time is far too big to consider me to change my mind. There is A LOT of similar games, lower-priced or even free, far more polished and enjoyable, with lemonade tycoon, a game from 2002 being prime example. I'd probably forgive it if lack of optimization and that game-breaking bug didn't happen, but it's a year since the release, and game looks like alpha early access. For 7 euro I'd expect short, but polished and enjoyable indie game, not a 2003-looking flash game that doesn't have anything interesting to offer apart from the worst optimization I've seen from all the thousands of games I've played until this day.\n\nI'm not saying that the game is absolute worst and you should avoid it, it has its own little charm, but that charm is hidden so deep that you're likely to throw a few swear words and uninstall before you even get to that point. If devs by any chance realize how broken their game is and actually fix two outstanding issues I highlighted above, I'll actually be happy to rate it mixed -> recommended instead, but I doubt it'll ever happen. To me this game is entirely broken and unplayable in its current state, recommending it would be a crime.", "timestamp_created": 1525659673, "timestamp_updated": 1525661598, "voted_up": false, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.62243276834487915", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41706642": {"recommendationid": "41706642", "author": {"steamid": "76561198008549198", "num_games_owned": 0, "num_reviews": 568, "playtime_forever": 637, "playtime_last_two_weeks": 0, "playtime_at_review": 637, "last_played": 1524780516}, "language": "english", "review": "It was decently fun until I finished the last quest, at which point the game decided to remove all my stores and retain (= forever lost) the associated luxury food slots (which are by far the most profitable).\nNow I'm condemned to grind for the last achievement at a ridiculously slow pace because of this big handicap, not to mention the time wasted rebuilding and restocking all stores... I guess this explains why the leaderboard has so few people above ~2M.\nBig, massive thumb down for this. Might have been a \"meh 5/10\" otherwise.\n\nOther negative point: the game doesn't retain your settings from one launch to the next. So, if like me you like playing in windowed mode and with no annoying BG music, you'll have to disable/lower the volume and switch to windowed mode every-single-time you run the game. It gets old...", "timestamp_created": 1524779402, "timestamp_updated": 1524779689, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.462406963109970093", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39283664": {"recommendationid": "39283664", "author": {"steamid": "76561198031945346", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 432, "playtime_last_two_weeks": 0, "playtime_at_review": 432, "last_played": 1495981551}, "language": "english", "review": "simple casual good business sim game", "timestamp_created": 1515771818, "timestamp_updated": 1515771818, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527559041976928711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38967606": {"recommendationid": "38967606", "author": {"steamid": "76561198150910877", "num_games_owned": 0, "num_reviews": 71, "playtime_forever": 955, "playtime_last_two_weeks": 0, "playtime_at_review": 520, "last_played": 1635957194}, "language": "english", "review": "Simple game, reminds me of Lemonade Tycoon - fixed locations, linear development, no challenge apart from the game modes themselves. Investors are a nice addition but don't offer complexity. No replayability.\nCute little game - if you take it for 2 bucks, it worth the deal.\n", "timestamp_created": 1514887039, "timestamp_updated": 1514887039, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.52476954460144043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36986791": {"recommendationid": "36986791", "author": {"steamid": "76561197995098207", "num_games_owned": 2162, "num_reviews": 103, "playtime_forever": 195, "playtime_last_two_weeks": 0, "playtime_at_review": 194, "last_played": 1513377318}, "language": "english", "review": "The biggest issue is that the game give you little information or data you need. Like why are some locations not selling out during good weather conditions? What is the actual price ceilings that customers will pay? What do any of the upgrades actually do? Is there a way to actually increase foot traffic?\n\nAfter a while this feels almost like an idle game as experiementing is hard to do when you get little feedback. When I try and look at specific sales stats on a cart and it skips you to the next day so you can look at many 2-3 carts out of your 10-24 total. The game has horrible grammar and the audio gets repetitive after a while since there is one track?\n\nI got to rank 62 on the leaderboards in roughly 3hrs which means only about 40 people actually got to the end.I would just not waste your time with it and I kinda wish I stopped before the 2hr point so I could have gotten a refund", "timestamp_created": 1511427335, "timestamp_updated": 1511427335, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.595203280448913574", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35081256": {"recommendationid": "35081256", "author": {"steamid": "76561198424011868", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 82, "playtime_last_two_weeks": 0, "playtime_at_review": 82, "last_played": 1505902038}, "language": "english", "review": "A casual simulator game with lot of similarity with a business, but so simple that children will understand if they play it. It is great for someone starting their first simulation management games. \n\nLot of unique content that indicate where the developer came from. Also I agree that the interface need a bit of polishing.    \n", "timestamp_created": 1505903016, "timestamp_updated": 1505903016, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.52476954460144043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33273537": {"recommendationid": "33273537", "author": {"steamid": "76561198216219873", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 99, "playtime_last_two_weeks": 0, "playtime_at_review": 99, "last_played": 1499175115}, "language": "english", "review": "If I knew how to play this game properly, I'd enjoy it more, so I do like it but I need to learn more about this, are there any tuorials for this?", "timestamp_created": 1499258815, "timestamp_updated": 1499258815, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.44613984227180481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31910563": {"recommendationid": "31910563", "author": {"steamid": "76561198071779662", "num_games_owned": 730, "num_reviews": 64, "playtime_forever": 77, "playtime_last_two_weeks": 0, "playtime_at_review": 77, "last_played": 1495502642}, "language": "english", "review": "Actually not a simulation of business but a casual game..\nYou'll always do the same thing for hours. Buy it only if you little little game, but not for 7.99$", "timestamp_created": 1495502547, "timestamp_updated": 1495502547, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523998439311981201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31545629": {"recommendationid": "31545629", "author": {"steamid": "76561198029058361", "num_games_owned": 356, "num_reviews": 20, "playtime_forever": 119, "playtime_last_two_weeks": 0, "playtime_at_review": 119, "last_played": 1493921578}, "language": "english", "review": "A very simplistic game with very poor english. You get better foods that make better profits by completing quests, but are limited to how many locations you can sell most foods. It' offers potential, but ends up being very lame. The description says \"Do your best to become the great businessman in the city\" but with no competition, if you have even half a brain this getting rich and unlocking everything is only a matter of time. Very much not worth the 7.99 they are charging.\nI really must emphasize the poor english. Do you speak engrish? because if you did you might have actually written the in-game text with non-asian accented english.\nAlso the name is decieving in that it says multishop (meaning a variety of types of stores maybe), rather than multi-foodcart which is what the game really is.", "timestamp_created": 1493921872, "timestamp_updated": 1493921972, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.648650288581848145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30521147": {"recommendationid": "30521147", "author": {"steamid": "76561198052725524", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 278, "playtime_last_two_weeks": 0, "playtime_at_review": 123, "last_played": 1617331370}, "language": "english", "review": "It's new and while yes the interface and \"introduction to the game\" need a bit of work, this a a fabulous time management game.  \nIt's a nice casual game if you are into leveling/upgrading things as with many time management games.\nOnly complaint is I wish the days were a tad longer and or more interaction of what's actually going on, the report could be more specific at the end of the day as to what products didn't sell, you have to check it yourself before going on to the next day.\nI do recommend it to the casual time management player.\nI spent many hours playing this game and spent my money all up, and now I am stuck to start over, HUGE FAIL, I'll try it again eventually but not today, I am not starting over.", "timestamp_created": 1489564572, "timestamp_updated": 1489567574, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.526498377323150635", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30509008": {"recommendationid": "30509008", "author": {"steamid": "76561198110829497", "num_games_owned": 6658, "num_reviews": 367, "playtime_forever": 725, "playtime_last_two_weeks": 0, "playtime_at_review": 489, "last_played": 1490046878}, "language": "english", "review": "great casual simulator of foods selling shops network - game's small, does not have any heavy hardware requirements, does not require any learning to play it, but its funny and addictive, bright and colourful, suitable even for children.\n\nsure, its not a complicated economics strategy, not a simulation of all complexities of a real world, its a simplified model of a business, but - after you play the game a little you will understand where are retail stores prices are coming from as you will be rising the prices to the maximum to get the maximum profits :) you will understand, why a cup of coffee that costs 0.1 euro to make is 2 euros in retail :)))) and maybe this knowledge will help you to save some money not buying junk foods at typical junk foods locations\n\ngame's addictiveness comes from a balanced game process, where you always need a little more money - to purchase a next stall, to get a next achivement, to upgrade - and - this is in fact a reality of real business. another reality is \"investors\" as they are shown in a game - they tend to offer too little for little too high price )))\n\nand the next big part of a game is \"office\" - you get access to \"office\" and its sevices only when you have enough money to spend ))) this is why lots and lots of small stores cannot afford proper advertising, web sites, design support, and, even when they know and feel the need to they tend to spend too little to get the quality marketing support.\n\noverall - great game, great experience, great simulation that touches the essentials without overcomplicating the process.", "timestamp_created": 1489504769, "timestamp_updated": 1489504769, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.486016422510147095", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30425625": {"recommendationid": "30425625", "author": {"steamid": "76561198006524453", "num_games_owned": 836, "num_reviews": 81, "playtime_forever": 50, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1489151316}, "language": "english", "review": "STAY AWAY FROM THIS GAME. This is NOT a simulation of a business, or a business tycoon game like they say. This is a bad port of a casual ios game AT BEST. There is very few options on anything. You earn different foods as you complete quests, great. You can choose from different food carts, that start off crap, and go all the way up to shit.  \n\n\"This game is really good for someone who starts to learn the basics of business.\" First of all, jesus, learn proper grammar. I don't give a damn if English isn't your first language. If you are going to sell a game to English speakers, than hire someone to proof read you shitty store page, so that your damn lies are proper.  Second, NO, this game is TERRIBLE at teaching anyone proper business techniques. This is a CASUAL game that has VERY LITTLE if ANYTHING to do with the real world. Please DO NOT use this game as any type of crash course in business. I feel like I am taking crazy pills reading shit like that.\n", "timestamp_created": 1489151717, "timestamp_updated": 1489151717, "voted_up": false, "votes_up": 65, "votes_funny": 7, "weighted_vote_score": "0.658425748348236084", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 18, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 10, "total_negative": 8, "total_reviews": 18}, "cursors": {"AoJ46P2W3NoCeaGIdA==": "Thu Nov 23 17:33:40 2023"}}
